class Domain:
    def __init__(self):
        self.categories = {
            0: '사람', 1: '자전거', 2: '자동차', 3: '오토바이', 4: '비행기', 
            5: '버스', 6: '기차', 7: '트럭', 8: '보트', 9: '신호등',
            10: '소화전', 11: '정지 표지판', 12: '주차료 징수기', 13: '벤치',
            14: '새', 15: '고양이', 16: '개', 17: '말', 18: '양', 19: '소',
            20: '코끼리', 21: '곰', 22: '얼룩말', 23: '기린', 24: '가방',
            25: '우산', 26: '핸드백', 27: '넥타이', 28: '서류 가방', 29: '원반',
            30: '스키', 31: '스노우 보드', 32: '공', 33: '연', 34: '야구 방망이',
            35: '야구 글러브', 36: '스케이트보드', 37: '서핑보드', 38: '테니스 라켓',
            39: '병', 40: '와인잔', 41: '컵', 42: '포크', 43: '나이프', 44: '숟가락',
            45: '그릇', 46: '바나나', 47: '사과', 48: '샌드위치', 49: '오렌지', 50: '브로콜리',
            51: '당근', 52: '핫도그', 53: '피자', 54: '도넛', 55: '케잌', 56: '의자',
            57: '쇼파', 58: '화분', 59: '식탁', 60: '식탁', 61: '화장실',
            62: '티비', 63: '노트북', 64: '마우스', 65: '리모컨', 66: '키보드', 67: '휴대전화',
            68: '전자레인지', 69: '오븐', 70: '토스터', 71: '싱크대', 72: '냉장고',
            73: '책', 74: '시계', 75: '꽃병', 76: '가위', 77: '곰 인형',
            78: '헤어 드라이기', 79: '칫솔'
        }
    
    def get_category(self, id):
        return self.categories.get(id, "UNK")